In [1]:
import pandas as pd
people={
    "first":["Corey","Jane","John"],
    "last":["Schafer","Doe","Doe"],
    "email":["coreyschafer@gmail.com","janedoe@gmail.com","johndoe@gmail.com"]
}
df=pd.DataFrame(people)

In [2]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [3]:
#To modify column name
df.columns=['first_name','last_name','email']

In [4]:
df

  first_name last_name                   email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [7]:
#To make column name as uppercase
df.columns=[x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [8]:
#To replace  underscore with space or vise versa
df.columns=df.columns.str.replace('_',' ')
df

  FIRST NAME LAST NAME                   EMAIL
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [10]:
df.columns=[x.lower() for x in df.columns]
df

  first name last name                   email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [17]:
# To rename the column 
df.rename(columns={'first name':'first', 'last name':'last'},inplace = True)
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [21]:
#To change the data of cell
df.loc[2]=['John','Smith','johnsmith@gmail.com']
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith     johnsmith@gmail.com

In [29]:
df.loc[2,['last','email']]=['Doe','JohnDoe@gmail.com']

In [30]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [31]:
df.loc[2,'last']='Smith'

In [32]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       JohnDoe@gmail.com

In [33]:
#at and loc both can be use interchangably
df.at[2,'last']='Doe'
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [40]:
filt=(df['email']=='JohnDoe@gmail.com')
df[filt]

  first last              email
2  John  Doe  JohnDoe@gmail.com

In [41]:
df[filt]['last']

2    Doe
Name: last, dtype: object

In [ ]:
# df[filt]['last']='Smith' IT will not work we have to use loc operator

In [43]:
df.loc[filt,'last']='Smith' #This we have already seen

In [44]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       JohnDoe@gmail.com

In [45]:
df['email'].str.lower()

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [46]:
df['email'].str.upper()

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [47]:
df['email']=df['email'].str.lower()

In [48]:
df['email']

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [49]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [50]:
df['email'].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [52]:
def update_email(email):
    return email.upper()

In [53]:
df['email'].apply(update_email)

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [54]:
df['email']=df['email'].apply(update_email)

In [55]:
df

   first     last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John    Smith       JOHNDOE@GMAIL.COM

In [56]:
df['email']=df['email'].apply(lambda x: x.lower())

In [57]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [58]:
df.apply(len)   #rows is the default

first    3
last     3
email    3
dtype: int64

In [59]:
len(df['email'])

3

In [60]:
df.apply(len, axis='columns')   #rows is the default

0    3
1    3
2    3
dtype: int64